API="http://127.0.0.1:8000"

## Test for cuda...
echo "Testing for CUDA..."
curl "${API}/nlp/gpu/info"
echo ""

## Test for NER...
MODEL="dslim/bert-base-NER"
DOCUMENT=$(cat << EOF
Κρήτη: Στη Βουλή το ζήτημα του «αποκλεισμού» των μικρών τουριστικών καταλυμάτων

efsyn.gr

Κοινή αναφορά κατέθεσαν οι βουλευτές Κρήτης του ΣΥΡΙΖΑ για τον «αποκλεισμό» των μικρών τουριστικών καταλυμάτων από το πρόγραμμα στήριξης του τουρισμού.

Συγκεκριμένα οι βουλευτές Νίκος Ηγουμενίδης, Σωκράτης Βαρδάκης, Μανόλης Θραψανιώτης, Χάρης Μαμουλάκης, Ανδρέας Ξανθός και Παύλος Πολάκης κατέθεσαν προς τους υπουργούς Ανάπτυξης, Τουρισμού και Οικονομικών την πρόσφατη ανακοίνωση της Συνομοσπονδίας Επιχειρηματιών Τουριστικών Καταλυμάτων Ελλάδος στην οποία χαρακτηριστικά τονίζεται ότι «η κυβέρνηση γυρίζει την πλάτη στα μικρά τουριστικά καταλύματα» και ασκείται έντονη κριτική στον “αποκλεισμό” αυτής της κατηγορίας καταλυμάτων από το πρόγραμμα ενίσχυσης του τουρισμού.

Στο κείμενο της αναφοράς σημειώνεται ότι «από το νέο πρόγραμμα στήριξης του τουρισμού αποκλείεται μια μεγάλη μερίδα πληττόμενων και υπερχρεωμένων επιχειρήσεων του κλάδου των μικρών τουριστικών καταλυμάτων αφού βασική προϋπόθεση για την ένταξή τους σε αυτό αποτελεί το κριτήριο απασχόλησης προσωπικού».

Όπως επίσης σημειώνεται, η παραπάνω προϋπόθεση «αφήνει εκτός του προγράμματος τα μικρά τουριστικά καταλύματα, αφού η πλειοψηφία τους πρόκειται για μικρές, οικογενειακές επιχειρήσεις των 7 με 10 δωματίων, κατά μέσο όρο».

Οι βουλευτές Κρήτης του ΣΥΡΙΖΑ σημειώνουν επίσης την επισήμανση της Συνομοσπονδίας ότι «η κυβέρνηση αφήνει στο έλεός τους τα μικρά τουριστικά καταλύματα που αποτελούν τον τουριστικό βραχίονα για τις περισσότερες τουριστικές περιοχές της χώρας, στηρίζοντας την ανάπτυξη των τοπικών κοινωνικών και των περιφερειακών οικονομιών» και ζητούν την απάντηση και τις σχετικές ενέργειες των υπουργών.
EOF
)

JSON_DATA=$( jq -n \
                  --arg mn "$MODEL" \
                  --arg doc "$DOCUMENT" \
                  '{model: $mn, data: $doc}' )
curl -X POST -H "Content-Type: application/json" \
    -d "$JSON_DATA" \
    "${API}/nlp/model/apply/nerc"
